---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.NominalWeight
source: html/d118a363-4748-d425-1ce5-bc76c266a872.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.NominalWeight Property

Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

## Syntax (C#)
```csharp
public double NominalWeight { get; set; }
```